### **Create & Access SQLite database using Python**
**Objective**
- Create a database
- create a table
- insert data into the table
- Query data from the table
- Retrieve teh result set into a pandas dataframe
- Close the database connection

*SQLite is a software library taht implements a self-contained serverless, zer0-configuration, transactional SQL database enigne. SQLite is the most widely deployed SQL database engine in the world*

### Task 1: Creaet database using SQLite

In [3]:
#Install and load sqlite3
#!pip install sqlite3
import sqlite3

In [4]:
conn = sqlite3.connect('INSTRUCTOR.db')

*Cursor class is an instance using which you can invoke methods that execute SQLie statements, fetch data from the results sets of the queiries. You can crete cursor object using the cursoer() method of the conecction object/class.*

In [5]:
#Cursor Object
cursor_obj = conn.cursor()

### Task 2: Create a table in the Database

In this step we will create a table in the database with following details:

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/table.png" align="center">

In [6]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [11]:
# Creating table
table = "CREATE TABLE IF NOT EXISTS INSTRUCTOR(ID INT PRIMAY KEY NOT NULL, FNAME VARCHAR(30), LNAME VARCHAR(20), CITY VARCHAR(20), CCODE CHAR(2)); "

In [12]:
cursor_obj.execute(table)
print("Table is Ready")

Table is Ready

### Task 3: Insert data into the table
In this step we will insert some rows of data into the table.

The INSTRUCTOR table we created in the previous step contains 3 rows of data:

<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/images/table1.png" align="center">

We will start by inserting just the first row of data, i.e. for instructor Rav Ahuja

In [13]:
cursor_obj.execute("""insert into instructor values(1, "Rav", "Ahuja", "Toronto", "CA")""")

In [14]:
cursor_obj.execute("""insert into instructor values(2, "Raul", "Chong", "Makham", "CA"), (3, "Him", "Vasudevan", "Chicago", "US" )""")

### Task 4: Query Data in the table

In [15]:
statement = """select * from instructor"""
cursor_obj.execute(statement)
print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'Toronto', 'CA')
(2, 'Raul', 'Chong', 'Makham', 'CA')
(3, 'Him', 'Vasudevan', 'Chicago', 'US')

In [16]:
# Fetch few rows from the table
statement = "select * from instructor"
cursor_obj.execute(statement)
print("All the data")
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

All the data
(1, 'Rav', 'Ahuja', 'Toronto', 'CA')
(2, 'Raul', 'Chong', 'Makham', 'CA')

In [17]:
# Fetch only Fname in the table
statement = "select fname from instructor"
cursor_obj.execute(statement)
print("ALL the data")
output_fname = cursor_obj.fetchall()
for fname in output_fname:
    print(fname)

ALL the data
('Rav',)
('Raul',)
('Him',)

In [18]:
cursor_obj.execute("select * from instructor")
cursor_obj.fetchall()

[(1, 'Rav', 'Ahuja', 'Toronto', 'CA'),
 (2, 'Raul', 'Chong', 'Makham', 'CA'),
 (3, 'Him', 'Vasudevan', 'Chicago', 'US')]

In [22]:
query_update = "update instructor set city = 'MOOSETOWN' where fname = 'Rav'"
cursor_obj.execute(query_update)

In [23]:
cursor_obj.execute('select * from instructor')
cursor_obj.fetchall()

[(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA'),
 (2, 'Raul', 'Chong', 'Makham', 'CA'),
 (3, 'Him', 'Vasudevan', 'Chicago', 'US')]

In [25]:
statement = 'select * from instructor'
cursor_obj.execute(statement)
print("All data")
Out_put = cursor_obj.fetchmany(2)
for row_all in Out_put:
    print(row_all)

All data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Makham', 'CA')

### Task 5: Retrieve Data into Pandas

In [26]:
import pandas as pd
#retrive the query results into a pandas dataframe
df = pd.read_sql_query("select * from instructor;", conn)
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong     Makham    CA
2   3   Him  Vasudevan    Chicago    US

In [27]:
df.LNAME[2]

'Vasudevan'

In [28]:
df.shape

(3, 5)

### Task 6: Close the Connection

In [29]:
conn.close()